---
type: ViewPrintingEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 4
tags: [revit-api, class]
---

# ViewPrintingEventArgs

`Autodesk.Revit.DB.Events.ViewPrintingEventArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetSettings | 2017 | `public IPrintSetting GetSettings ()` |
| Property | Index | 2010 | `public int Index { get ; }` |
| Property | TotalViews | 2010 | `public int TotalViews { get ; }` |
| Property | View | 2010 | `public View View { get ; }` |